Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་བཀོད་པ་ལ་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་ཐམས་ཅད་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་ཡོངས་སུ་སྒྲུབ་པ་དང་།
en: This discourse focuses on setting out on the bodhisattva path that accomplishes all profound buddha qualities: the strengths and four types of fearlessness.

source: ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་སྒོར་འཇུག་པ།
en: It is the source of wisdom, the gateway to the dhāraṇī seal that grants mastery of all teachings.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་རྣམ་པར་གཏན་ལ་དབབ་པ་ལ་གཞོལ་བའི་སྒོར་འཇུག་པ།
en: It is a gateway that establishes the four types of discriminating knowledge.

source: མངོན་པར་ཤེས་པ་ཆེན་པོའི་ཡེ་ཤེས་ལ་གཞོལ་བའི་སྒོར་འཇུག་པ།
en: It is a gateway to the wisdom of great superknowledge.

source: ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལ་མི་སྐྱེ་བའི་ཆོས་སྟོན་པ།
en: It teaches the Dharma of nonorigination to the retinue of those who will not be turned back from awakening.

source: ཐེག་པ་ཐམས་ཅད་ཐེག་པ་གཅིག་ཏུ་མཉམ་པ་ཉིད་དུ་ཡང་དག་པར་འདུ་བ།
en: It condenses all vehicles into sameness, into a single vehicle.

source: ཆོས་ཀྱི་དབྱིངས་ཚུལ་གཅིག་ཅིང་མ་འདྲེས་པ་ལ་འཇུག་པ།
en: It enters the uncontaminated, unique realm of phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་དབང་པོ་ལ་འཇུག་པ།
en: It engages the dispositions and faculties of all sentient beings.

source: སྟོན་པ་སྙིང་པོ་དང་ལྡན་པ།
en: This discourse is an essential teaching.

source: ཆོས་རྣམ་པར་གདོན་མི་ཟ་བ།
en: It is a Dharma of total certainty.

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇོམས་པར་བྱེད་པ།
en: It destroys the entire retinue of Māra.

source: ཚུལ་བཞིན་གྱི་ཆོས་ཀྱི་ཚུལ་ལ་གཞོལ་བར་འཇུག་པ།
en: It leads to engagement in the appropriate Dharma methods.

source: ཉོན་མོངས་པ་དང་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་འདུལ་བ།
en: It overcomes all afflictive emotions and views.

source: ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པ།
en: It accords with wisdom free of attachment.

source: ཐུབ་པ་མེད་པར་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའི་ཐབས་དང་ཡེ་ཤེས་སྟོན་པ།
en: It teaches skill in means and the wisdom of unobstructed dedication to the roots of virtue.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པ།
en: It leads to the wisdom of the sameness of all buddhas.

source: ཆགས་པ་མེད་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྒོར་འཇུག་པ།
en: It is the gateway to the blessings of nonattachment.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་ངེས་པ་སྟོན་པ།
en: It elaborates on the exact nature of all phenomena.

source: རྟོག་པ་མེད་པ་དང་རྣམ་པར་རྟོག་པ་མེད་པ་མཉམ་པ་ཉིད་དུ་འཇུག་པ།
en: This discourse leads to sameness free of discursive thought and concepts.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཐམས་ཅད་བསགས་པའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་མཉམ་པ་ཉིད་རྟོགས་པར་བྱེད་པ།
en: It brings about understanding of the sameness of the twelve links of profound dependent arising due to accumulating all the collections of merit and wisdom.

source: སངས་རྒྱས་ཀྱི་སྐུ་དང་། གསུང་དང་། ཐུགས་མཉམ་པ་ཉིད་ཀྱི་རྒྱན་དང་ལྡན་པ།
en: It is furnished with the ornament of the sameness of the body, speech, and mind of the buddhas.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། མོས་པ་དང་། ཤེས་རབ་ཟད་མི་ཤེས་པ་མངོན་པར་སྒྲུབ་པ།
en: It accomplishes inexhaustible mindfulness, intelligence, realization, devotion, and wisdom.

source: ཉན་ཐོས་ཀྱི་ཐེག་པས་འདུལ་བའི་ཕྱིར་འཕགས་པའི་བདེན་པའི་ཚུལ་ལ་འཇུག་པ།
en: It engages the method of the noble truths in order to tame beings through the vehicle of the śrāvakas.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་འདུལ་བའི་ཕྱིར་ལུས་དང་། ངག་དང་། སེམས་རབ་ཏུ་དབེན་པར་ཤེས་པ།
en: It knows the solitude of body, speech, and mind in order to tame beings through the vehicle of the pratyekabuddhas.

source: ཐེག་པ་ཆེན་པོས་འདུལ་བའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སར་དབང་བསྐུར་བ་རབ་ཏུ་ཐོབ་པ།
en: It attains the consecration at the stage of the wisdom of omniscience in order to tame beings through the Great Vehicle.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐམས་ཅད་བརྗོད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བའི་ཚུལ་ལ་འཇུག་པ་འདི་ལྟ་བུའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ་དང་། བསྙད་པ་དང་། བཤད་པ་དང་། བཀླག་པ་དང་། གཟུང་བ་དང་། རྣམ་པར་ཤེས་པར་བྱ་བ་དང་།
en: Such a Dharma discourse leads to the mastery of all teachings in order to express all the qualities of the Tathāgata. so that this discourse could be taught, elucidated, explained, recited, memorized, and understood.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་བསྐང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྤྲུལ་པ་ཡང་དག་པར་བསྟན་པ་དང་། འཁོར་གྱི་ཐེ་ཚོམ་ཐམས་ཅད་གཅད་པ་དང་།
en: He did this to satisfy all the hosts of bodhisattvas, to display the miraculous power of the Tathāgata, and to eliminate the doubts of the retinue.

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཚར་གཅད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འབར་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་མཛད་པ་ཆེན་པོ་ཡོངས་སུ་ཐོབ་པར་བྱ་བའི་ཕྱིར།
en: He did it to defeat the entire retinue of Māra, to allow the teaching of the Tathāgata blaze forth, and to perform great buddha activity.

source: བཅོམ་ལྡན་འདས་གདན་སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་སོ།། །།
en: The Blessed One took his seat on the lion throne

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་སྲོག་ཤིང་ཞེས་བྱ་བས་སངས་རྒྱས་ཀྱི་རྒྱན་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་སངས་རྒྱས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: Then, by the power of the Buddha, the following events occurred. The bodhisattva known as Ratnayaṣṭi attained the array of buddha ornaments absorption and magically adorned the entire retinue with buddha ornaments.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་བསྒྲགས་སྟོབས་ཀྱི་རྒྱལ་པོས་པདྨ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་ལག་པ་རྣམས་སུ་མེ་ཏོག་གི་ལྡ་ལྡི་དག་དང་། མེ་ཏོག་གི་སྐོན་བུ་རྣམས་བྱིན་གྱིས་བརླབས་ཏེ།
en: Then the bodhisattva Sovereign of Powerful Reverberating Sound attained the lotus array absorption and conjured up flower garlands and bouquets and placed them in the hands of the entire retinue.

source: མེ་ཏོག་གི་ལྡ་ལྡི་དང་། མེ་ཏོག་གི་སྐོན་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ལ་མངོན་པར་འཐོར་རོ། །
en: They proceeded to toss the flower garlands and the bouquets toward the Blessed One and the gathering of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་མཆོག་རྒྱ་མཚོས་དྲི་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་དུ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་དྲིར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva named Ocean of Supreme Intelligence attained the fragrance array absorption and magically infused the fragrance of sandalwood into all the pores of the entire retinue.

source: བྱང་ཆུབ་སེམས་དཔའ་འོད་ཟེར་དྲ་བ་ཅན་གྱིས་འོད་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་ལུས་ཀྱི་འོད་མཐའ་ཡས་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva named Light-Web Bearer attained the light array absorption and magically imbued the entire retinue with limitless physical radiance.

source: བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པས་མིག་མི་འཛུམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་ཕྱོགས་ཤིང་མིག་མི་འཛུམས་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva named Mind of Great Compassion attained the unblinking gaze absorption and conjured upon the retinue an unblinking gaze when in the presence of the Tathāgata.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་མཐའ་ཡས་དྲི་མེད་ཀྱིས་ཆོས་ལ་མཆོག་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཆོས་དོན་དུ་གཉེར་ཞིང་ཆོས་ལ་དགའ་བ་དང་མོས་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva named Immaculate Limitless Intelligence attained the absorption supremely delighted by the Dharma and magically imbued the entire retinue with the zeal for righteousness and with delight in and devotion toward the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པའི་རྒྱན་བཀོད་པས་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་སྒྲིབ་པ་ལྔ་རྣམ་པར་སེལ་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva called Ornamental Display of Courage attained the completely peaceful absorption and magically imbued the entire retinue with the removal of the five obstructions.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོས་བརྗེད་པ་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་བྱང་ཆུབ་ཀྱི་སེམས་དྲན་ཞིང་དེ་བཞིན་གཤེགས་པ་ལ་དམིགས་པ་མི་བརྗེད་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva called Sovereign Who Emanates All Phenomena attained the action devoid of forgetfulness absorption and magically imbued the entire retinue with mindfulness of the thought of awakening and with remembrance of the Tathāgata as the object of attention.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ནས་སྣང་བ་ཞེས་བྱ་བས་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནསཐམས་ཅད་དང་ལྡན་པའི་འཁོར་བདུད་དང་། ཕྱིར་རྒོལ་བ་བཅོམ་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: The bodhisattva mahāsattva Illuminator attained the undefeatable absorption and magically imbued the entire retinue with the conquest of Māra and all adversaries.

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རབ་ཏུ་འཇོམས་པས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇོམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Then, at that time, by the power of the Buddha, the bodhisattva Māra­pramardaka attained the conquering the entire retinue of Māra absorption.

source: བྱང་ཆུབ་སེམས་དཔའི་བདུད་རབ་ཏུ་འཇོམས་པས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇོམས་པའི་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དཔུང་དང་བཅས། གཡོག་འཁོར་དང་བཅས་ཏེ་མྱུར་བ་མྱུར་བར་རིངས་ཐབས་སུ་རང་རང་གི་བདུད་ཀྱི་གནས་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: At the very moment that the bodhisattva Māra­pramardaka attained that absorption, all the billion demons throughout the trichiliocosm, surrounded by their armies and retinues of servants, disappeared very swiftly and immediately from their individual residences.

source: འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས། དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Appearing before the Blessed One in the pavilion Jeweled Array, they prostrated themselves at his feet.

source: ལྷའི་མཆོད་པ་རྣམ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བཅོམ་ལྡན་འདས་ལ་མཆོད་ནས་གུས་པ་དང་བཅས་ཤིང་ཞེ་ས་དང་བཅས་པར་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་བཏབ་ནས།
en: They offered the Blessed One many hundreds of thousands of divine gifts, and with their palms respectfully and reverently joined they asked the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གསོལ་བ་འཚལ་ན་བཅོམ་ལྡན་འདས་ཆོས་བཤད་དུ་གསོལ།
en: “If we beseech you, Blessed One, ‘Please explain the Dharma!

source: བདེ་བར་གཤེགས་པ་ཆོས་བཤད་དུ་གསོལ། བྱང་ཆུབ་སེམས་དཔའ་བདུད་རབ་ཏུ་འཇོམས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བདག་ཅག་བདུད་ཀྱི་སུག་ལས་འདོར་ཞིང་སླན་ཆད་སེམས་ཅན་རྣམས་ལ་མིག་གིས་མི་རྩོལ་བར་འགྱུར་བའི་ལས་མི་བགྱིད་དོ། །
en: Sugata, please explain the Dharma!’ then, through the blessing of the bodhisattva Māra­pramardaka, we will discard any demonic deeds and henceforth will not perform deeds that confuse sentient beings.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་དབུགས་དབྱུང་བ་སྩོལ་ཅིག་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་མཆིས་ཏེ། བདག་ཅག་ཆོས་ཉན་པར་བགྱིད་དོ། །
en: O Blessed One! Please grant us relief so that we may listen to the Dharma in your presence.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་དེ་དག་དབུགས་དབྱུང་བའི་ཕྱིར་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Thereupon, in order to grant relief to those demons, the Blessed One said,

source: གྲོགས་པོ་དག་ལེགས་སོ་ལེགས་སོ། །
en: “Friends, very well, it is very good.

source: གང་གི་ཕྱིར་ཁྱེད་བདུད་ཀྱི་ལས་ཀྱང་འོར་ལ་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་བཤད་པར་གསོལ་བ་ཡང་ཐོབ་ཤིག་དང་།
en: Give up your demonic deeds and beseech the Tathāgata to teach the Dharma!

source: དེ་ཉིད་ཁྱེད་ཀྱི་བདུད་ཀྱི་ལམ་ཐམས་ཅད་ལས་འདའ་བའི་རྒྱུར་འགྱུར་རོ། །
en: This will indeed become the cause for leaving behind all the ways of Māra.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: སངས་རྒྱས་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སྟོབས་བསྐྱེད་པའི་ཕྱིར་རོ། །
en: It will do so because it generates the power that produces the roots of virtue for buddhahood.

source: གྲོགས་པོ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་མུན་པ་མུན་ནག་ལོ་དུ་མར་བསགས་པ་ནི་མར་མེ་གཅིག་གིས་མེད་པར་འགྱུར་རོ། །
en: “Friends, just as complete darkness that has prevailed for many years can be eliminated by a single lamp,

source: གྲོགས་པོ་དག་དེ་བཞིན་དུ་ཉོན་མོངས་པའི་མུན་པ་མུན་ནག་བསྐལ་པ་བརྒྱར་བསགས་པ་ཡང་ཡེ་ཤེས་ཀྱི་སྟོབས་བསྐྱེད་པ་གཅིག་གིས་མེད་པར་འགྱུར་རོ། །
en: in the same way, my friends, the complete darkness of the afflictive emotions that has prevailed for a hundred eons can be eliminated by a single generation of the power of wisdom.

source: གྲོགས་པོ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བའི་དཀྱིལ་འཁོར་གཅིག་དང་། ཉི་མའི་དཀྱིལ་འཁོར་གཅིག་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་གཅིག་གིས་མུན་པ་མུན་ནག་ཐམས་ཅད་སེལ་ཏོ། །
en: Friends, just as the moon, the sun, or a large precious jewel can dispel all darkness, in the same way, my friends, a single virtuous thought endowed with insight can eliminate all the darkness of unknowing.

source: གྲོགས་པོ་དག་དེ་བཞིན་དུ་དགེ་བའི་སེམས་ལྷག་མཐོང་དང་ལྡན་པ་གཅིག་གིས་མི་ཤེས་པའི་མུན་པ་མུན་ནག་ཐམས་ཅད་སེལ་ཏོ། །གྲོགས་པོ་དག་དེའི་ཕྱིར་ཁྱེད་དགེ་བའི་རྩ་བ་འདིས་རིམ་གྱིས་མི་ཤེས་པའི་མུན་པ་མུན་ནག་ཐམས་ཅད་བསལ་ནས་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Friends, that is why, through this root of virtue, you will gradually remove all the darkness of unknowing and attain the great illumination of the Dharma.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point, the bodhisattva Dharmeśvara­rāja, who was present among the members of the retinue, said,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཡུལ་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པ་དང་། ཀུན་ཏུ་བསྟན་པ་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: “Blessed One, the buddha domain blessed and revealed by the Tathāgata is inconceivable.

source: དེང་ནི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་ཞེས་བགྱི་བ་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པར་བཞེད་པར་ཐེ་ཚོམ་མ་མཆིས་སོ། །
en: I have no doubt that the Tathāgata will agree to teach the Dharma discourse of the Great Assembly chapter called The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: བཅོམ་ལྡན་འདས་ཨེ་མ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདུས་པ་འདི་ནི་ཆེ་སྟེ།
en: Blessed One, this assembly of outstanding bodhisattvas is great.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གྱིས་མི་ཁྱབ་པའི་གོ་ཆ་བགོས་པ།
en: “Blessed One, they have donned the inconceivable bodhisattva armor.

source: མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཆེན་པོས་རྣམ་པར་རོལ་པ།
en: They sport with the great wisdom of the superknowledges.

source: ཕྱོགས་བཅུར་སྒྲ་བསྒྲགས་པ་སེམས་ཤིན་ཏུ་བྱང་བར་བགྱིས་ཏེ་
en: They resound in the ten directions.

source: དྲི་མ་མ་མཆིས་པར་རིག་པ་དང་།
en: They are aware that stains do not exist when the mind has become purified.

source: རྣམ་པར་གྲོལ་བས་སྣང་བར་གྱུར་པ།
en: They are illuminated by liberation.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པ།
en: They are praised and commended by buddhas.

source: ཆོས་ཐམས་ཅད་ལ་དབང་ཕྱུག་གིས་དབང་སྒྱུར་བ།
en: They attain sovereign mastery over all phenomena.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་སོན་པ།
en: They bring all perfections to perfection.

source: ཐབས་ལ་མཁས་པ་ཐམས་ཅད་ལས་ངེས་པར་སྐྱེས་པ།
en: They emerge through all sorts of skillful methods.

source: བདུད་ཀྱི་ལས་དང་རྩོད་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་བསལ་བ།
en: They dispel all demonic deeds, hostilities, and afflictive emotions.

source: ཕས་ཀྱི་རྒོལ་བ་དང་། ངན་པའི་ཚོགས་ཅན་གྱི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་འདུལ་བ།
en: They tame all hosts of opponents and evil forces.

source: ཚིག་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་བསྟན་པ་ཤེས་པ་ལ་མཁས་པ།
en: They know how to analyze and teach all words.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆགས་པ་མ་མཆིས་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: They attain perfect wisdom without attachment.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ཁྲེལ་ཡོད་པ་དང་། མོས་པ་དང་། གཟུངས་དང་། ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ།
en: They have obtained mindfulness, intelligence, realization, modesty, devotion, retention, and wisdom.

source: བྱིན་གྱི་རླབས་ཐོགས་པ་མ་མཆིས་ཤིང་སྤོབས་པ་རྒྱུན་མི་འཆད་པ། །
en: They have unobstructed blessing and uninterrupted eloquence.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོས་མཆོག་དང་། མཆོག་མ་ལགས་པ་ཤེས་པ་ལ་མཁས་པ།
en: They know how to distinguish the inferior and superior faculties of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་པ།
en: They teach the Dharma in accordance with the predispositions of all beings.

source: འཁྲུལ་པ་མ་མཆིས་པར་ཁ་ན་མ་ཐོ་བ་མ་མཆིས་པའི་ཆོས་སྟོན་པ།
en: They teach the flawless Dharma without mistake.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་དང་སྐད་ལ་མཁས་པ།
en: They are skilled in the languages and dialects of all beings.

source: མི་འམ་ཅི་དང་། བྱ་ཀ་ལ་པིང་ཀ་དང་། ཁྲུང་ཁྲུང་གི་སྒྲ་དང་། ཚངས་པའི་སྒྲ་དབྱངས་ཅན།
en: They are endowed with the voices of kiṃnaras, kalaviṅka birds, and cranes and the melodious voice of Brahmā.

source: ཤིན་ཏུ་བཤེས་གཉེན་བགྱིས་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལ་འགོད་པ།
en: “They establish all beings in nirvāṇa by acting as their spiritual friends.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ལྷག་པའི་བསམ་པ་ཅན།
en: They are motivated by great benevolence and vast compassion.

source: བརྟན་ཞིང་ཤིན་ཏུ་གནས་ལ་མི་གཡོ་ཞིང་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིད་པ།
en: They are stable, settled, and unwavering. They act on their words.

source: ཆོས་ཀྱི་རྒྱལ་མཚན་ཡང་དག་པར་བསྒྲེང་བར་བགྱིད་པ།
en: They hoist the Dharma banner.

source: རྡོ་རྗེ་ལྟར་སྲ་ཞིང་མི་ཤིགས་པའི་ཁོར་ཡུག་ལྟ་བུ།
en: They are firm like a vajra and indestructible like the ring of mountains.

source: སྨོན་པ་མ་མཆིས་པའི་སྨོན་ལམ་དང་ལྡན་པ།
en: They make aspiration prayers free of any wishes.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་བལྟ་དཀའ་ཞིང་རྟོགས་པར་དཀའ་བ་ལ་ཞུགས་པ།
en: They are established in profound dependent arising, which is difficult to see and comprehend.

source: ཆད་པ་དང་། རྟག་པའི་མཐའ་གཉི་ག་དང་། ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་བཅད་པ།
en: They have cut off the two extremes of eternalism and nihilism, all views, and the karmic traces.

source: ཚོགས་ཅན་ཆེན་པོའི་ཚོགས་ཀྱི་རྒྱལ་པོ་ཡོངས་སུ་འགུགས་པ།
en: They command a following that befits a great king.

source: དེད་དཔོན་ཆེན་པོ་བསྐལ་པ་གྲངས་མེད་པར་ཆོས་དཀོན་མཆོག་གིས་བསོད་ནམས་ཡང་དག་པར་བསྒྲུབས་པ།
en: They are great leaders who have for countless eons accomplished merit through the Jewel of the Dharma.

source: སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་གཟུགས་ཅན་མ་ལགས་པའི་ནད་གསོ་བར་བགྱིད་པ།
en: They are great kings of physicians who cure the incorporeal disease of the afflictive emotions of all sentient beings.

source: སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ། སྣྲེལ་ཞིའི་རྒྱུད་དང་། སྤྱིའུ་ཚུགས་ཀྱི་རྒྱུད་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལ་མི་སྐྲག་པ།
en: They are without fear of the resounding of the great lion’s roar, of all types nonsequential and inverted progression, and of the mystery of the Tathāgata.

source: མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལུས་ལེགས་པར་བརྒྱན་པ།
en: Their bodies will be well adorned by the excellent marks and signs.

source: གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བགྱིད་པ།
en: They make unstinting offerings.

source: ཐམས་ཅད་ལ་སེམས་དཔའ་བ།
en: They are courageous in every respect.

source: བདུད་བཞི་དང་། ཉོན་མོངས་པའི་གཡུལ་འདུལ་བ།
en: They defeat the army of all afflictive emotions and the four māras.

source: མཉན་པ་ལྟ་བུར་གྱུར་པ།
en: They are like ferrymen.

source: དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ། ཤིན་ཏུ་ཡོངས་སུ་སྦྱང་བ་བགྱིས་པ།
en: They thoroughly cultivate the spiritual faculties, the strengths, the factors of awakening, the concentrations, the liberations, and entering the absorptions.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་སྒྲོལ་བ་ལ་བརྩོན་པ།
en: “They exert themselves to fully liberate all sentient beings.

source: རི་ལྟ་བུར་གྱུར་པ།
en: They are like mountains.

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་པོ་རྙེད་པ་དང་། མ་རྙེད་པ་དང་། གྲགས་པ་དང་། མ་གྲགས་པ་དང་། སྨད་པ་དང་། བསྟོད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་ལས་ལོག་པ།
en: They turn away from the eight worldly dharmas: gain, loss, fame, ill repute, blame, praise, joy, and suffering.

source: དགའ་བ་དང་། དང་བ་དང་། མཆོག་ཏུ་དགའ་བའི་ཆོས་ལ་སེམས་ཞུགས་པ།
en: They are settled in the joyous, delightful, and rapturous Dharma.

source: ཆོས་དཀོན་མཆོག་གི་འོད་ཟེར་དང་ལྡན་པ།
en: They bask in the radiance of the Jewel of the Dharma.

source: ཤེས་རབ་ཀྱིས་ངོམས་ནས་ངོམས་པར་བགྱིད་པ།
en: They achieve contentment through wisdom.

source: པདྨ་ལྟ་བུ་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པ།
en: Like a lotus, they are unstained by any conditioned phenomena.

source: འོད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། ཟླ་བ་དང་། ཉི་མ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པའི་འོད་མོག་མོག་པོར་བགྱིད་པ།
en: They have pure halos that dim the light of the moon, the sun, Śakra, and Brahmā.

source: རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ།
en: They attain the ocean mudrā absorption.

source: ཆོས་དཀོན་མཆོག་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བ།
en: They engage in all aspects of the Jewel of the Dharma.

source: དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་གཅོད་པ།
en: They do not interrupt the lineage of the Three Jewels.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་།
en: They mature all beings.

source: འདུལ་བའི་ཆོ་ག་འཚལ་བ།
en: They perform subduing rituals.

source: སངས་རྒྱས་ཀྱི་ཆོས་དཀོན་མཆོག་ཐམས་ཅད་ཀྱི་མཛོད་ཡང་དག་པར་འཛིན་པ།
en: They maintain the treasury of all the jewels of the Buddhadharma.

source: བསྔགས་པ་མཐའ་ཡས་པ་དང་ཡང་དག་པར་ལྡན་པ།
en: They are limitlessly praised.

source: བསོད་ནམས་ཚད་མ་མཆིས་པ་བསགས་པ།
en: They accumulate infinite merit.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཉེ་བར་གྱུར་པ།
en: They approach the wisdom of omniscience, which is excellent in every respect.

source: ཕྱི་མའི་མཐའི་མུའི་བསྐལ་པར་བསྔགས་པ་མཐར་མི་ཕྱིན་པ་འདི་ལྟ་བུ་རྣམས་ཀྱི་འདུས་པ་ལགས་སོ། །
en: Such is this assembly, which could be praised until the end of time.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བདག་འདི་སྙམ་དུ། བཅོམ་ལྡན་འདས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པས་ངེས་པར་འབྱུང་བ་སྒྲིབ་པ་མེད་པའི་སྒོ་ཞེས་བགྱི་བ་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པར་བཞེད་པ་སྙམ་བགྱིད་དོ། །
en: “This being so, Blessed One, I had the thought that you would agree to teach the Dharma discourse of the Great Assembly chapter called The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སངས་རྒྱས་འབྱུང་བ་ནི་ཕན་འདོགས་པར་འགྱུར་བ། སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་འགྱུར་བ། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡང་དག་པར་སྐྱེད་པ། སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་སྦྱོང་བ། སྤྱོད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་གཅིག་ལ་འཇུག་པ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་ལ་དབང་བསྐུར་བ། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱུ་དང་འབྲས་བུ་ཆུད་མི་ཟ་བ། ངེས་པའི་སེམས་ཅན་རྣམས་ལ་རྐྱེན་ཉེ་བར་སྒྲུབ་པ། མ་ངེས་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་ཉེ་བར་སྒྲུབ་པ། ལོག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་རྣམས་ལམ་ལ་འཛུད་པ། ཐེག་པ་གསུམ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་དགོད་པ་སྟོན་པ་སྟེ་ངོ་མཚར་ཏོ། །
en: “Blessed One, it is wonderful that the appearance of a present buddha benefits and appeases all sentient beings, generates the roots of virtue of future bodhisattvas, purifies the intentions of the bodhisattvas who have generated the first thought of awakening, uniquely engages bodhisattvas who have entered the bodhisattva way of life, empowers in the Buddhadharma bodhisattvas who are irreversible from awakening, does not let go to waste the causes and fruits of bodhisattvas who are kept back by one last birth, prepares conditions for sentient beings who are established on the path, causes the practice of great compassion for sentient beings who are not established on the path, and causes sentient beings who are definitely on a wrong path to be placed upon the true path. To sentient beings who aspire to the three vehicles, a buddha teaches their arrangements.
